tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
const char* runSourceName(FeederRunSource source) {
  switch (source) {
    case FeederRunSource::Manual: return "Manual";
    case FeederRunSource::Schedule: return "Schedule";
  }
  return "Manual";
}

const char* recordTypeName(FeederRecordType type) {
  switch (type) {
    case FeederRecordType::ManualRequested: return "FeederManualRequested";
    case FeederRecordType::ScheduleTriggered: return "FeederScheduleTriggered";
    case FeederRecordType::ScheduleMissed: return "FeederScheduleMissed";
    case FeederRecordType::ChannelStarted: return "FeederChannelStarted";
    case FeederRecordType::ChannelStopped: return "FeederChannelStopped";
    case FeederRecordType::BatchCompleted: return "FeederBatchCompleted";
    case FeederRecordType::FaultCleared: return "FeederFaultCleared";
    case FeederRecordType::TodayCleared: return "FeederTodayCleared";
  }
  return "UnknownEvent";
}

bool recordTypeFromName(const char* name, FeederRecordType& out) {
  if (name == nullptr || name[0] == '\0') {
    return false;
  }
  if (strcmp(name, "FeederManualRequested") == 0 || strcmp(name, "ManualRequested") == 0) {
    out = FeederRecordType::ManualRequested;
    return true;
  }
  if (strcmp(name, "FeederScheduleTriggered") == 0 || strcmp(name, "ScheduleTriggered") == 0) {
    out = FeederRecordType::ScheduleTriggered;
    return true;
  }
  if (strcmp(name, "FeederScheduleMissed") == 0 || strcmp(name, "ScheduleMissed") == 0) {
    out = FeederRecordType::ScheduleMissed;
    return true;
  }
  if (strcmp(name, "FeederChannelStarted") == 0 || strcmp(name, "ChannelStarted") == 0) {
    out = FeederRecordType::ChannelStarted;
    return true;
  }
  if (strcmp(name, "FeederChannelStopped") == 0 || strcmp(name, "ChannelStopped") == 0) {
    out = FeederRecordType::ChannelStopped;
    return true;
  }
  if (strcmp(name, "FeederBatchCompleted") == 0 || strcmp(name, "BatchCompleted") == 0) {
    out = FeederRecordType::BatchCompleted;
    return true;
  }
  if (strcmp(name, "FeederFaultCleared") == 0 || strcmp(name, "FaultCleared") == 0) {
    out = FeederRecordType::FaultCleared;
    return true;
  }
  if (strcmp(name, "FeederTodayCleared") == 0 || strcmp(name, "TodayCleared") == 0) {
    out = FeederRecordType::TodayCleared;
    return true;
  }
  return false;
}

const char* recordResultName(FeederRecordResult result) {
  switch (result) {
    case FeederRecordResult::Ok: return "Ok";
    case FeederRecordResult::Partial: return "Partial";
    case FeederRecordResult::Busy: return "Busy";
    case FeederRecordResult::Fault: return "Fault";
    case FeederRecordResult::Skipped: return "Skipped";
    case FeederRecordResult::InvalidArgument: return "InvalidArgument";
  }
  return "InvalidArgument";
}

void sendUint8(uint8_t value) {
  char number[8];
  snprintf(number, sizeof(number), "%u", static_cast<unsigned>(value));
  Esp32BaseWeb::sendChunk(number);
}

void sendInt32(int32_t value) {
  char number[16];
  snprintf(number, sizeof(number), "%ld", static_cast<long>(value));
  Esp32BaseWeb::sendChunk(number);
}

void sendUint32(uint32_t value) {
  char number[16];
  snprintf(number, sizeof(number), "%lu", static_cast<unsigned long>(value));
  Esp32BaseWeb::sendChunk(number);
}

FeederRecordTime currentRecordTime() {
  FeederRecordTime time;
#if ESP32BASE_ENABLE_NTP
  const Esp32BaseNtp::TimeSnapshot snapshot = Esp32BaseNtp::snapshot();
  time.unixTime = snapshot.synced ? snapshot.epochSec : 0;
  time.uptimeSec = snapshot.uptimeSec;
  time.bootId = snapshot.bootId;
#endif
  return time;
}

#if ESP32BASE_ENABLE_FS
bool appendFeederRecordBytes(const char* path, const uint8_t* data, std::size_t length, void*) {
  return Esp32BaseFs::appendBytes(path, data, length);
}

bool feederRecordPathExists(const char* path, void*) {
  return Esp32BaseFs::exists(path);
}

int64_t feederRecordFileSize(const char* path, void*) {
  return Esp32BaseFs::fileSize(path);
}

bool removeFeederRecordFile(const char* path, void*) {
  return Esp32BaseFs::removeFile(path);
}

bool renameFeederRecordFile(const char* from, const char* to, void*) {
  return Esp32BaseFs::rename(from, to);
}

bool readFeederRecordBytesAt(const char* path,
                             uint32_t offset,
                             uint8_t* out,
                             std::size_t maxLength,
                             std::size_t* readLength,
                             void*) {
  return Esp32BaseFs::readBytesAt(path, offset, out, maxLength, readLength);
}

bool ensureRecordStorageReady() {
  if (g_recordStorageReady) {
    return true;
  }
  if (!Esp32BaseFs::isReady()) {
    return false;
  }
  if (!Esp32BaseFs::exists(kFeederRecordRootDir) && !Esp32BaseFs::mkdir(kFeederRecordRootDir)) {
    return false;
  }
  if (!Esp32BaseFs::exists(kFeederRecordDir) && !Esp32BaseFs::mkdir(kFeederRecordDir)) {
    return false;
  }
  g_recordStorageReady = true;
  return true;
}
#endif

void recordBusinessEvent(const FeederRecord& record) {
  const FeederRecord stored = g_records.append(record, currentRecordTime());
#if ESP32BASE_ENABLE_FS
  if (!ensureRecordStorageReady()) {
    return;
  }
  const FeederRecordRotateResult rotateResult =
      rotateFeederRecordPathIfNeeded(kFeederRecordCurrentPath,
                                     kFeederRecordMaxCurrentBytes,
                                     kFeederRecordMaxArchives,
                                     kFeederRecordEncodedMaxBytes,
                                     feederRecordFileSize,
                                     feederRecordPathExists,
                                     removeFeederRecordFile,
                                     renameFeederRecordFile,
                                     nullptr);
  if (rotateResult != FeederRecordRotateResult::Ok) {
    ESP32BASE_LOG_W("farmfeeder", "record_rotate_failed result=%u",
                    static_cast<unsigned>(rotateResult));
  }
  const FeederRecordWriteResult result = appendFeederRecordToPath(
      stored, kFeederRecordCurrentPath, appendFeederRecordBytes, nullptr);
  if (result != FeederRecordWriteResult::Ok) {
    ESP32BASE_LOG_W("farmfeeder", "record_append_failed result=%u",
                    static_cast<unsigned>(result));
  }
#endif
}

void sendChannelArray(const FeederSnapshot& snapshot, const FeederRunSnapshot& runs) {
  Esp32BaseWeb::sendChunk("[");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    Esp32BaseWeb::sendChunk("{\"index\":");
    sendUint8(i);
    Esp32BaseWeb::sendChunk(",\"state\":\"");
    Esp32BaseWeb::sendChunk(channelStateName(snapshot.channels[i]));
    Esp32BaseWeb::sendChunk("\",\"run\":{\"active\":");
    const FeederRunChannel& run = runs.channels[i];
    Esp32BaseWeb::sendChunk(run.active ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"source\":\"");
    Esp32BaseWeb::sendChunk(runSourceName(run.source));
    Esp32BaseWeb::sendChunk("\",\"targetPulses\":");
    char number[16];
    snprintf(number, sizeof(number), "%ld", static_cast<long>(run.targetPulses));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"estimatedGramsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(run.estimatedGramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"actualPulses\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(run.actualPulses));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk("}}");
  }
  Esp32BaseWeb::sendChunk("]");
}

void sendScheduleSummary(const FeederScheduleSnapshot& snapshot) {
  Esp32BaseWeb::sendChunk("{\"maxPlans\":");
  sendUint8(kFeederMaxPlans);
  Esp32BaseWeb::sendChunk(",\"planCount\":");
  sendUint8(snapshot.planCount);
  Esp32BaseWeb::sendChunk(",\"timeValid\":");
#if ESP32BASE_ENABLE_NTP
  const Esp32BaseNtp::TimeSnapshot timeSnapshot = Esp32BaseNtp::snapshot();
  Esp32BaseWeb::sendChunk(timeSnapshot.synced ? "true" : "false");
#else
  Esp32BaseWeb::sendChunk("false");
#endif
  Esp32BaseWeb::sendChunk(",\"serviceDate\":");
  char summaryNumber[16];
  snprintf(summaryNumber, sizeof(summaryNumber), "%lu", static_cast<unsigned long>(snapshot.serviceDate));
  Esp32BaseWeb::sendChunk(summaryNumber);
  Esp32BaseWeb::sendChunk(",\"lastEvaluatedMinute\":");
  snprintf(summaryNumber, sizeof(summaryNumber), "%u", static_cast<unsigned>(g_lastScheduleMinute));
  Esp32BaseWeb::sendChunk(summaryNumber);
  Esp32BaseWeb::sendChunk(",\"plans\":[");
  for (uint8_t i = 0; i < snapshot.planCount; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    const FeederPlanState& plan = snapshot.plans[i];
    Esp32BaseWeb::sendChunk("{\"planId\":");
    sendUint8(plan.config.planId);
    Esp32BaseWeb::sendChunk(",\"enabled\":");
    Esp32BaseWeb::sendChunk(plan.config.enabled ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"timeMinutes\":");
    char number[8];
    snprintf(number, sizeof(number), "%u", static_cast<unsigned>(plan.config.timeMinutes));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"channelMask\":");
    sendUint8(plan.config.channelMask);
    Esp32BaseWeb::sendChunk(",\"skipToday\":");
    Esp32BaseWeb::sendChunk(plan.skipToday ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"skipServiceDate\":");
    sendUint32(plan.skipServiceDate);
    Esp32BaseWeb::sendChunk(",\"scheduleAttemptedToday\":");
    Esp32BaseWeb::sendChunk(plan.scheduleAttemptedToday ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"todayExecuted\":");
    Esp32BaseWeb::sendChunk(plan.todayExecuted ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"scheduleMissedToday\":");
    Esp32BaseWeb::sendChunk(plan.scheduleMissedToday ? "true" : "false");
    Esp32BaseWeb::sendChunk("}");
  }
  Esp32BaseWeb::sendChunk("]}");
}

void sendPlanTime(uint16_t timeMinutes) {
  sendUint8(static_cast<uint8_t>(timeMinutes / 60));
  Esp32BaseWeb::sendChunk(":");
  if (timeMinutes % 60 < 10) {
    Esp32BaseWeb::sendChunk("0");
  }
  sendUint8(static_cast<uint8_t>(timeMinutes % 60));
}

void sendPlanTargetSummary(const FeederPlanConfig& config) {
  bool first = true;
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    const uint8_t bit = static_cast<uint8_t>(1U << i);
    if ((config.channelMask & bit) == 0) {
      continue;
    }
    if (!first) {
      Esp32BaseWeb::sendChunk("；");
    }
    first = false;
    Esp32BaseWeb::sendChunk("通道");
    sendUint8(static_cast<uint8_t>(i + 1));
    Esp32BaseWeb::sendChunk(" ");
    const FeederChannelTarget& target = config.targets[i];
    if (target.mode == FeederTargetMode::Grams) {
      sendInt32(target.targetGramsX100);
      Esp32BaseWeb::sendChunk("/100 g");
    } else if (target.mode == FeederTargetMode::Revolutions) {
      sendInt32(target.targetRevolutionsX100);
      Esp32BaseWeb::sendChunk("/100 圈");
    } else {
      Esp32BaseWeb::sendChunk("未配置");
    }
  }
  if (first) {
    Esp32BaseWeb::sendChunk("未配置通道");
  }
}

void sendOccurrenceStatus(const FeederPlanState& plan,
                          uint32_t serviceDate,
                          uint32_t currentServiceDate) {
  if (!plan.config.enabled || !plan.config.timeConfigured) {
    Esp32BaseWeb::sendChunk("未启用");
    return;
  }
  if (plan.skipServiceDate == serviceDate) {
    Esp32BaseWeb::sendChunk("已跳过本次");
    return;
  }
  if (serviceDate == currentServiceDate) {
    if (plan.todayExecuted) {
      Esp32BaseWeb::sendChunk("已完成");
    } else if (plan.scheduleAttemptedToday) {
      Esp32BaseWeb::sendChunk("已尝试");
    } else if (plan.scheduleMissedToday) {
      Esp32BaseWeb::sendChunk("已错过");
    } else {
      Esp32BaseWeb::sendChunk("待执行");
    }
    return;
  }
  Esp32BaseWeb::sendChunk("将执行");
}

void sendOccurrenceAction(const FeederPlanState& plan, uint32_t serviceDate) {
  if (!plan.config.enabled || !plan.config.timeConfigured || serviceDate == 0) {
    Esp32BaseWeb::sendChunk("-");
    return;
  }
  const bool skipped = plan.skipServiceDate == serviceDate;
  Esp32BaseWeb::sendChunk("<form method='post' action='");
  Esp32BaseWeb::sendChunk(skipped ? "/api/app/schedule-occurrence/cancel-skip"
                                  : "/api/app/schedule-occurrence/skip");
  Esp32BaseWeb::sendChunk("'><input type='hidden' name='planId' value='");
  sendUint8(plan.config.planId);
  Esp32BaseWeb::sendChunk("'><input type='hidden' name='date' value='");
  sendUint32(serviceDate);
  Esp32BaseWeb::sendChunk("'><button>");
  Esp32BaseWeb::sendChunk(skipped ? "取消跳过" : "跳过本次");
  Esp32BaseWeb::sendChunk("</button></form>");
}

void sendOccurrenceTable(const FeederScheduleSnapshot& schedules,
                         uint32_t serviceDate,
                         const char* title) {
  Esp32BaseWeb::sendChunk("<section><h2>");
  Esp32BaseWeb::sendChunk(title);
  Esp32BaseWeb::sendChunk("</h2>");
  if (serviceDate == 0) {
    Esp32BaseWeb::sendChunk("<p>时间未同步，暂不能展示具体执行日期。</p></section>");
    return;
  }
  Esp32BaseWeb::sendChunk("<p>服务日期 ");
  sendUint32(serviceDate);
  Esp32BaseWeb::sendChunk("</p><table><tr><th>时间</th><th>计划</th><th>状态</th><th>目标</th><th>操作</th></tr>");
  for (uint8_t i = 0; i < schedules.planCount; ++i) {
    const FeederPlanState& plan = schedules.plans[i];
    Esp32BaseWeb::sendChunk("<tr><td>");
    sendPlanTime(plan.config.timeMinutes);
    Esp32BaseWeb::sendChunk("</td><td>计划 ");
    sendUint8(plan.config.planId);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendOccurrenceStatus(plan, serviceDate, schedules.serviceDate);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendPlanTargetSummary(plan.config);
    Esp32BaseWeb::sendChunk("</td><td>");
    sendOccurrenceAction(plan, serviceDate);
    Esp32BaseWeb::sendChunk("</td></tr>");
  }
  Esp32BaseWeb::sendChunk("</table></section>");
}

void sendBucketSummary(const FeederBucketSnapshot& snapshot) {
  Esp32BaseWeb::sendChunk("[");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    const FeederBucketState& channel = snapshot.channels[i];
    Esp32BaseWeb::sendChunk("{\"channel\":");
    sendUint8(i);
    Esp32BaseWeb::sendChunk(",\"enabled\":");
    Esp32BaseWeb::sendChunk(channel.baseInfo.enabled ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"outputPulsesPerRev\":");
    char number[16];
    snprintf(number, sizeof(number), "%ld", static_cast<long>(channel.baseInfo.outputPulsesPerRev));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"gramsPerRevX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(channel.baseInfo.gramsPerRevX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"capacityGramsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(channel.baseInfo.capacityGramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"remainGramsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(channel.remainGramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"remainPercent\":");
    sendUint8(channel.remainPercent);
    Esp32BaseWeb::sendChunk(",\"underflow\":");
    Esp32BaseWeb::sendChunk(channel.underflow ? "true" : "false");
    Esp32BaseWeb::sendChunk("}");
  }
  Esp32BaseWeb::sendChunk("]");
}

void sendTodaySummary(const FeederTodaySnapshot& snapshot) {
  Esp32BaseWeb::sendChunk("{\"serviceDate\":");
  sendUint32(snapshot.serviceDate);
  Esp32BaseWeb::sendChunk(",\"channels\":[");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    const FeederTodayChannel& channel = snapshot.channels[i];
    Esp32BaseWeb::sendChunk("{\"channel\":");
    sendUint8(i);
    Esp32BaseWeb::sendChunk(",\"pulses\":");
    char number[16];
    snprintf(number, sizeof(number), "%ld", static_cast<long>(channel.pulses));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"gramsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(channel.gramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk("}");
  }
  Esp32BaseWeb::sendChunk("]}");
}

void sendBaseInfoSummary(const FeederBucketSnapshot& snapshot) {
  Esp32BaseWeb::sendChunk("[");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    const FeederChannelBaseInfo& info = snapshot.channels[i].baseInfo;
    Esp32BaseWeb::sendChunk("{\"channel\":");
    sendUint8(i);
    Esp32BaseWeb::sendChunk(",\"enabled\":");
    Esp32BaseWeb::sendChunk(info.enabled ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"name\":\"通道 ");
    sendUint8(static_cast<uint8_t>(i + 1));
    Esp32BaseWeb::sendChunk("\",\"outputPulsesPerRev\":");
    char number[16];
    snprintf(number, sizeof(number), "%ld", static_cast<long>(info.outputPulsesPerRev));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"gramsPerRevX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(info.gramsPerRevX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"capacityGramsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(info.capacityGramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk("}");
  }
  Esp32BaseWeb::sendChunk("]");
}

const char* targetModeName(FeederTargetMode mode) {
  switch (mode) {
    case FeederTargetMode::None: return "None";
    case FeederTargetMode::Grams: return "Grams";
    case FeederTargetMode::Revolutions: return "Revolutions";
  }
  return "None";
}

const char* targetResultName(FeederTargetResult result) {
  switch (result) {
    case FeederTargetResult::Ok: return "Ok";
    case FeederTargetResult::InvalidArgument: return "InvalidArgument";
    case FeederTargetResult::NotCalibrated: return "NotCalibrated";
  }
  return "InvalidArgument";
}

void sendTargetSummary(const FeederTargetSnapshot& targets, const FeederBucketSnapshot& buckets) {
  Esp32BaseWeb::sendChunk("[");
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    const FeederTargetRequest& target = targets.channels[i];
    const FeederChannelBaseInfo& info = buckets.channels[i].baseInfo;
    const FeederResolvedTarget resolved = resolveFeederTarget(info, target);
    Esp32BaseWeb::sendChunk("{\"channel\":");
    sendUint8(i);
    Esp32BaseWeb::sendChunk(",\"enabled\":");
    Esp32BaseWeb::sendChunk(info.enabled ? "true" : "false");
    Esp32BaseWeb::sendChunk(",\"targetMode\":\"");
    Esp32BaseWeb::sendChunk(targetModeName(target.mode));
    Esp32BaseWeb::sendChunk("\",\"targetGramsX100\":");
    char number[16];
    snprintf(number, sizeof(number), "%ld", static_cast<long>(target.targetGramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"targetRevolutionsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(target.targetRevolutionsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"targetPulses\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(resolved.targetPulses));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"estimatedGramsX100\":");
    snprintf(number, sizeof(number), "%ld", static_cast<long>(resolved.estimatedGramsX100));
    Esp32BaseWeb::sendChunk(number);
    Esp32BaseWeb::sendChunk(",\"calibrated\":");
    Esp32BaseWeb::sendChunk(info.gramsPerRevX100 > 0 ? "true" : "false");
    Esp32BaseWeb::sendChunk("}");
  }
  Esp32BaseWeb::sendChunk("]");
}

