tangyangguang/FarmAuto/apps/Esp32FarmFeeder/src/FarmFeederApp.cpp
void FarmFeederApp::handleFeederTarget() {
#if ESP32BASE_ENABLE_WEB
  uint8_t channel = 0;
  FeederTargetRequest request;
  if (!readUint8Param("channel", channel) || !validAppChannel(channel) ||
      !readTargetModeParam("targetMode", request.mode) ||
      !readInt32ParamOptional("targetGramsX100", request.targetGramsX100) ||
      !readInt32ParamOptional("targetRevolutionsX100", request.targetRevolutionsX100)) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  const FeederTargetResult result = g_targets.setTarget(channel, request);
  if (result == FeederTargetResult::Ok) {
    persistFeederTargetsIfReady();
  }
  sendResultJson(result == FeederTargetResult::Ok ? 200 : 400,
                 result == FeederTargetResult::Ok ? "Ok" : "InvalidArgument");
#endif
}

void FarmFeederApp::handleFeederManualStart() {
#if ESP32BASE_ENABLE_WEB
  uint8_t channelMask = 0;
  if (!readUint8Param("channelMask", channelMask) ||
      (channelMask & static_cast<uint8_t>(~configuredChannelMask())) != 0) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  FeederTargetBatch targets;
  const uint32_t commandId = allocateCommandId();
  const FeederStartResult result =
      startResolvedTargets(channelMask, FeederRunSource::Manual, commandId, targets);
  FeederRecord record;
  record.commandId = commandId;
  record.type = FeederRecordType::ManualRequested;
  record.result = feederRecordResultFromCommand(result.result);
  record.requestedMask = channelMask;
  record.successMask = result.successMask;
  record.busyMask = result.busyMask;
  record.faultMask = result.faultMask;
  record.skippedMask = result.skippedMask;
  recordBusinessEvent(record);
  sendStartResultJson(result, &targets, commandId);
#endif
}

void FarmFeederApp::handleFeederStart() {
#if ESP32BASE_ENABLE_WEB
  uint8_t channelMask = 0;
  if (!readUint8Param("channelMask", channelMask)) {
    uint8_t channel = 0;
    if (!readUint8Param("channel", channel) || !validAppChannel(channel)) {
      sendResultJson(400, "InvalidArgument");
      return;
    }
    channelMask = static_cast<uint8_t>(1U << channel);
  } else if ((channelMask & static_cast<uint8_t>(~configuredChannelMask())) != 0) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  FeederTargetBatch targets;
  const uint32_t commandId = allocateCommandId();
  const FeederStartResult result =
      startResolvedTargets(channelMask, FeederRunSource::Manual, commandId, targets);
  FeederRecord record;
  record.commandId = commandId;
  record.type = FeederRecordType::ManualRequested;
  record.result = feederRecordResultFromCommand(result.result);
  record.requestedMask = channelMask;
  record.successMask = result.successMask;
  record.busyMask = result.busyMask;
  record.faultMask = result.faultMask;
  record.skippedMask = result.skippedMask;
  recordBusinessEvent(record);
  sendStartResultJson(result, &targets, commandId);
#endif
}

void FarmFeederApp::handleFeederStop() {
#if ESP32BASE_ENABLE_WEB
  uint8_t channelMask = 0;
  if (!readUint8Param("channelMask", channelMask)) {
    uint8_t channel = 0;
    if (!readUint8Param("channel", channel) || !validAppChannel(channel)) {
      sendResultJson(400, "InvalidArgument");
      return;
    }
    channelMask = static_cast<uint8_t>(1U << channel);
  } else if ((channelMask & static_cast<uint8_t>(~configuredChannelMask())) != 0) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  const uint32_t commandId = allocateCommandId();
  const FeederCommandResult result = g_feeder.stopChannels(channelMask);
  if (result == FeederCommandResult::Ok) {
    g_runs.stop(channelMask);
  }
  FeederRecord record;
  record.commandId = commandId;
  record.type = FeederRecordType::ChannelStopped;
  record.result = feederRecordResultFromCommand(result);
  record.requestedMask = channelMask;
  record.successMask = result == FeederCommandResult::Ok ? channelMask : 0;
  recordBusinessEvent(record);
  sendResultJson(result == FeederCommandResult::Ok ? 200 : 400,
                 feederCommandResultName(result),
                 commandId);
#endif
}

void FarmFeederApp::handleFeederStopAll() {
#if ESP32BASE_ENABLE_WEB
  const uint8_t runningMask = g_feeder.snapshot().runningChannelMask;
  const uint32_t commandId = allocateCommandId();
  const FeederCommandResult result = g_feeder.stopAll();
  if (result == FeederCommandResult::Ok) {
    g_runs.stopAll();
  }
  FeederRecord record;
  record.commandId = commandId;
  record.type = FeederRecordType::ChannelStopped;
  record.result = feederRecordResultFromCommand(result);
  record.requestedMask = runningMask;
  record.successMask = result == FeederCommandResult::Ok ? runningMask : 0;
  recordBusinessEvent(record);
  sendResultJson(result == FeederCommandResult::Ok ? 200 : 400,
                 feederCommandResultName(result),
                 commandId);
#endif
}

void FarmFeederApp::handleMaintenanceClearToday() {
#if ESP32BASE_ENABLE_WEB
  const FeederSnapshot snapshot = g_feeder.snapshot();
  if (snapshot.runningChannelMask != 0) {
    sendResultJson(409, "Busy");
    return;
  }
  char resource[40];
  snprintf(resource, sizeof(resource), "today:%lu",
           static_cast<unsigned long>(g_schedules.snapshot().serviceDate));
  if (!requireConfirm("clear-today", resource)) {
    return;
  }

  const uint32_t commandId = allocateCommandId();
  g_schedules.clearToday();
  g_today.beginDay(g_schedules.snapshot().serviceDate);
  persistFeederScheduleIfReady();
  persistFeederTodayIfReady();

  FeederRecord record;
  record.commandId = commandId;
  record.type = FeederRecordType::TodayCleared;
  record.result = FeederRecordResult::Ok;
  recordBusinessEvent(record);

  sendResultJson(200, "Ok", commandId);
#endif
}

void FarmFeederApp::handleMaintenanceClearFault() {
#if ESP32BASE_ENABLE_WEB
  uint8_t channelMask = 0;
  if (!readUint8Param("channelMask", channelMask)) {
    uint8_t channel = 0;
    if (!readUint8Param("channel", channel) || !validAppChannel(channel)) {
      sendResultJson(400, "InvalidArgument");
      return;
    }
    channelMask = static_cast<uint8_t>(1U << channel);
  } else if ((channelMask & static_cast<uint8_t>(~configuredChannelMask())) != 0) {
    sendResultJson(400, "InvalidArgument");
    return;
  }
  char resource[40];
  snprintf(resource, sizeof(resource), "channelMask:%u", static_cast<unsigned>(channelMask));
  if (!requireConfirm("clear-fault", resource)) {
    return;
  }

  const uint32_t commandId = allocateCommandId();
  uint8_t successMask = 0;
  uint8_t skippedMask = 0;
  for (uint8_t i = 0; i < kFeederConfiguredChannels; ++i) {
    const uint8_t bit = static_cast<uint8_t>(1U << i);
    if ((channelMask & bit) == 0) {
      continue;
    }
    const FeederCommandResult result = g_feeder.clearChannelFault(i);
    if (result == FeederCommandResult::Ok) {
      successMask |= bit;
    } else {
      skippedMask |= bit;
    }
  }

